[
    {
        "start": {
            "year": 900
        },
        "event": "Mayan Empire collapses"
    },
    {
        "start": {
            "year": 907
        },
        "event": "Tang Dynasty ends with Emperor Ai deposed"
    },
    {
        "start": {
            "year": 910
        },
        "event": "King Edward the Elder of England, son of King Alfred, defeats the Northumbrian Vikings at the Battle of Tettenhall; they never raid south of the River Humber again"
    },
    {
        "start": {
            "year": 910
        },
        "event": "Cluny Abbey is founded by William I, Count of Auvergne"
    },
    {
        "start": {
            "year": 911
        },
        "event": "The Viking Rollo and his tribe settle in what is now Normandy by the terms of the Treaty of Saint-Clair-sur-Epte, founding the Duchy of Normandy"
    },
    {
        "start": {
            "year": 917
        },
        "event": "Battle of Anchialus. Simeon I the Great defeats the Byzantines"
    },
    {
        "start": {
            "year": 919
        },
        "event": "Henry the Fowler, Duke of Saxony elected German King. First king of the Ottonian Dynasty"
    },
    {
        "start": {
            "year": 925
        },
        "event": "The first King of Croatia (rex Croatorum), Tomislav (910–928) of the Trpimirović dynasty was crowned"
    },
    {
        "start": {
            "year": 927
        },
        "event": "King Aethelstan the Glorious unites the heptarchy of The Anglo-Saxon nations of Wessex,Sussex, Essex, Kent, East Anglia, Mercia and Northumbria founding the Kingdom of England"
    },
    {
        "start": {
            "year": 927
        },
        "event": "According to Theophanes Continuatus (The Continuer of Theophanes's Chronicle) - Tomislav of Croatia defeated Bulgarian army of Tsar Simeon I under Duke Alogobotur, in battle of the Bosnian Highlands"
    },
    {
        "start": {
            "year": 927
        },
        "event": "Death of Simeon I the Great. Recognition of the Bulgarian Patriarchate, the first independent National Church in Europe"
    },
    {
        "start": {
            "year": 929
        },
        "event": "Abd-ar-Rahman III of the Umayyad dynasty in al-Andalus (part of the Iberian peninsula) takes the title of Caliph or ruler of the Islamic world"
    },
    {
        "start": {
            "year": 936
        },
        "event": "Wang Geon unified Later Three Kingdoms of Korea"
    },
    {
        "start": {
            "year": 955
        },
        "event": "Battle of Lechfeld. Otto the Great, son of Henry the Fowler, defeats the Magyars"
    },
    {
        "start": {
            "year": 960
        },
        "event": "Mieszko I becomes duke of Polans"
    },
    {
        "start": {
            "year": 960
        },
        "event": "Song Dynasty begins after Emperor of Taizu usurps the throne from the Later Zhou, last of the Five Dynasties"
    },
    {
        "start": {
            "year": 962
        },
        "event": "Otto the Great crowned the Holy Roman Emperor"
    },
    {
        "start": {
            "year": 963
        },
        "event": "Otto deposes Pope John XII who is replaced with Pope Leo VIII"
    },
    {
        "start": {
            "year": 965
        },
        "event": "Mieszko I of Poland and his court embrace Christianity, which becomes national religion"
    },
    {
        "start": {
            "year": 969
        },
        "event": "John I Tzimiskes the last Byzantium empire and Nikephoros II are being executed"
    },
    {
        "start": {
            "year": 976
        },
        "event": "Death of John I Tzimiskes; Basil II (his co-emperor) takes sole power"
    },
    {
        "start": {
            "year": 978
        },
        "event": "Al-Mansur Ibn Abi Aamir becomes de facto ruler of Muslim Al-Andalus"
    },
    {
        "start": {
            "year": 981
        },
        "event": "Basil II (called \"Bulgar Slayer\") begins final conquest of Bulgaria by Eastern Empire"
    },
    {
        "start": {
            "year": 985
        },
        "event": "Eric the Red, exiled from Iceland, begins Scandinavian colonization of Greenland"
    },
    {
        "start": {
            "year": 987
        },
        "event": "Succession of Hugh Capet to the French Throne"
    },
    {
        "start": {
            "year": 988
        },
        "event": "Volodymyr I of Kiev embrace Christianity, which becomes national religion"
    },
    {
        "start": {
            "year": 989
        },
        "event": "Peace and Truce of God formed"
    }
]