[
    {
        "start": {
            "year": 1202
        },
        "event": "The Fourth Crusade sacked Croatian town of Zadar (Italian: Zara), a rival of Venice. Unable to raise enough funds to pay to their Venetian contractors, the crusaders agreed to sack the city despite letters from Pope Innocent III forbidding such an action and threatening excommunication"
    },
    {
        "start": {
            "year": 1204
        },
        "event": "Sack of Constantinople during the Fourth Crusade"
    },
    {
        "start": {
            "year": 1205
        },
        "event": "Battle of Adrianople. The Bulgarians under Emperor Kaloyan defeat Baldwin I"
    },
    {
        "start": {
            "year": 1206
        },
        "event": "Genghis Khan was elected as Khagan of the Mongols and the Mongol Empire was established"
    },
    {
        "start": {
            "year": 1208
        },
        "event": "Pope Innocent III calls for the Albigensian Crusade which seeks to destroy a rival form of Christianity practiced by the Cathars"
    },
    {
        "start": {
            "year": 1209
        },
        "event": "The University of Cambridge is founded"
    },
    {
        "start": {
            "year": 1209
        },
        "event": "Founding of the Franciscan Order"
    },
    {
        "start": {
            "year": 1212
        },
        "event": "Spanish Christians succeed in defeating the Moors in the long Reconquista campaigns, after the Battle of Las Navas de Tolosa"
    },
    {
        "start": {
            "year": 1215
        },
        "event": "The Magna Carta is sealed by John of England"
    },
    {
        "start": {
            "year": 1215
        },
        "event": "Fourth Lateran Council. Dealt with transubstantiation, papal primacy and conduct of clergy. Proclaimed that Jews and Muslims should wear identification marks to distinguish them from Christians"
    },
    {
        "start": {
            "year": 1216
        },
        "event": "Papal recognition of the Dominican Order"
    },
    {
        "start": {
            "year": 1219
        },
        "event": "Serbian Orthodox Church becomes autocephalous under St. Sava, its first Archbishop"
    },
    {
        "start": {
            "year": 1227
        },
        "event": "Genghis Khan dies"
    },
    {
        "start": {
            "year": 1237
        },
        "event": "Mongol invasion of Rus' resumes"
    },
    {
        "start": {
            "year": 1257
        },
        "event": "Founding of the University of Paris"
    },
    {
        "start": {
            "year": 1257
        },
        "event": "Provisions of Oxford forced upon Henry III of England"
    },
    {
        "start": {
            "year": 1258
        },
        "event": "Siege of Baghdad"
    },
    {
        "start": {
            "year": 1272
        },
        "event": "The Ninth Crusade occurs"
    },
    {
        "start": {
            "year": 1273
        },
        "event": "Rudolph I of Germany is elected Holy Roman Emperor"
    },
    {
        "start": {
            "year": 1274
        },
        "event": "Thomas Aquinas' work, Summa Theologica is published, after his death"
    },
    {
        "start": {
            "year": 1279
        },
        "event": "Battle of Yamen"
    },
    {
        "start": {
            "year": 1282
        },
        "event": "Sicilian Vespers. Sicilians massacre Angevins over a six-week period, after a Frenchman harassed a woman"
    },
    {
        "start": {
            "year": 1283
        },
        "event": "Catalan Courts"
    },
    {
        "start": {
            "year": 1296
        },
        "event": "Edward I of England invades Scotland, starting the First War of Scottish Independence"
    },
    {
        "start": {
            "year": 1297
        },
        "event": "The Battle of Stirling Bridge"
    },
    {
        "start": {
            "year": 1298
        },
        "event": "Marco Polo publishes his tales of China, along with Rustichello da Pisa"
    },
    {
        "start": {
            "year": 1299
        },
        "event": "The Ottoman Empire is founded by Osman I"
    }
]