[
    {
        "start": {
            "year": 1600
        },
        "event": "On February 17 Giordano Bruno is burned at the stake by the Inquisition"
    },
    {
        "start": {
            "year": 1600
        },
        "event": "Michael the Brave unifies the three Romanian countries: Wallachia, Moldavia and Transylvania after the Battle of Șelimbăr from 1599"
    },
    {
        "start": {
            "year": 1601
        },
        "event": "Battle of Kinsale, England defeats Irish and Spanish forces at the town of Kinsale, driving the Gaelic aristocracy out of Ireland and destroying the Gaelic clan system"
    },
    {
        "start": {
            "year": 1601
        },
        "event": "Michael the Brave (first unifier of Romania), voivode of Wallachia, Moldavia and Transylvania, is assassinated by the order of the Habsburg general Giorgio Basta at Câmpia Turzii"
    },
    {
        "start": {
            "year": 1601
        },
        "end": {
            "year": 1603
        },
        "event": "The Russian famine of 1601–1603 kills perhaps one-third of Russia"
    },
    {
        "start": {
            "year": 1601
        },
        "event": "Panembahan Senopati, first king of Mataram, dies and passes rule to his son Panembahan Seda ing Krapyak"
    },
    {
        "start": {
            "year": 1601
        },
        "event": "Matteo Ricci is given permission to live in Beijing"
    },
    {
        "start": {
            "year": 1602
        },
        "event": "Matteo Ricci produces the Map of the Myriad Countries of the World (坤輿萬國全圖, Kūnyú Wànguó Quántú), a world map that will be used throughout East Asia for centuries"
    },
    {
        "start": {
            "year": 1602
        },
        "event": "The Portuguese send a major (and last) expeditionary force from Malacca which succeeded in reimposing a degree of Portuguese control"
    },
    {
        "start": {
            "year": 1602
        },
        "event": "The Dutch East India Company (VOC) is established by merging competing Dutch trading companies. Its success contributes to the Dutch Golden Age"
    },
    {
        "start": {
            "year": 1602
        },
        "event": "June, British East India Company's first voyage, commanded by Sir James Lancaster, arrives in Aceh and sails on to Bantam where he is allowed to build trading post which becomes the centre of British trade in Indonesia until 1682"
    },
    {
        "start": {
            "year": 1602
        },
        "event": "Two emissaries from the Aceh Sultanate visit the Dutch Republic"
    },
    {
        "start": {
            "year": 1603
        },
        "event": "Elizabeth I of England dies and is succeeded by her cousin King James VI of Scotland, uniting the crowns of Scotland and England"
    },
    {
        "start": {
            "year": 1603
        },
        "event": "Tokugawa Ieyasu takes the title of Shogun, establishing the Tokugawa Shogunate. This begins the Edo period, which will last until 1869"
    },
    {
        "start": {
            "year": 1603
        },
        "end": {
            "year": 1623
        },
        "event": "After modernizing his army, Abbas I expands the Persian Empire by capturing territory from the Ottomans and the Portuguese"
    },
    {
        "start": {
            "year": 1603
        },
        "event": "First permanent Dutch trading post is established in Banten, West Java. First successful VOC privateering raid on a Portuguese ship"
    },
    {
        "start": {
            "year": 1604
        },
        "event": "A second English East India Company voyage commanded by Sir Henry Middleton reaches Ternate, Tidore, Ambon and Banda. Fierce VOC hostility is encountered in Banda thus beginning Anglo-Dutch competition for access to spices"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "Tokugawa Ieyasu passes the title of Shogun to his son, Tokugawa Hidetada, and \"retires\" to Sunpu"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "Gunpowder Plot failed in England"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "The fortresses of Veszprém and Visegrad are retaken by the Ottomans"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "February, The VOC in alliance with Hitu prepare to attack a Portuguese fort in Ambon but the Portuguese surrender"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "Panembahan Seda ing Krapyak of Mataram establishes control over Demak, former center of the Demak Sultanate"
    },
    {
        "start": {
            "year": 1605
        },
        "event": "The King of Gowa, a Makassarese kingdom in South Sulawesi, converts to Islam"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "The Long War between the Ottoman Empire and Austria is ended with the Peace of Zsitvatorok—Austria abandons Transylvania"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "Treaty of Vienna ends anti-Habsburg uprising in Royal Hungary"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "Assassination of Stephen Bocskay of Transylvania"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "Time of Troubles: Vasili IV becomes Tzar of Russia"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "The Dutch East India Company enters into an alliance with the Johor Sultanate to attack Portuguese Malacca, but they are repelled"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "Captain Willem Janszoon and his crew aboard the Dutch East India Company ship Duyfken becomes the first recorded Europeans to sight and make landfall in Australia"
    },
    {
        "start": {
            "year": 1606
        },
        "event": "A Spanish fleet occupies Ternate and Tidore"
    },
    {
        "start": {
            "year": 1607
        },
        "event": "Jamestown, Virginia, is settled as what would become the first permanent English colony in North America"
    },
    {
        "start": {
            "year": 1607
        },
        "event": "Flight of the Earls (the fleeing of most of the native Gaelic aristocracy) occurs from County Donegal in the west of Ulster in Ireland"
    },
    {
        "start": {
            "year": 1607
        },
        "event": "Iskandar Muda becomes the Sultan of Aceh (r. 1607–1637). He will launch a series of naval conquests that will transform Aceh into a great power in the western Malay Archipelago"
    },
    {
        "start": {
            "year": 1608
        },
        "event": "Quebec City founded by Samuel de Champlain in New France (present-day Canada)"
    },
    {
        "start": {
            "year": 1608
        },
        "event": "The Dutch East India Company establishes a settlement in Siamese Ayutthaya"
    },
    {
        "start": {
            "year": 1609
        },
        "event": "The Netherlands and Spain agree to a Twelve Years' Truce in the Eighty Years' War"
    },
    {
        "start": {
            "year": 1609
        },
        "event": "Maximilian of Bavaria establishes the Catholic League"
    },
    {
        "start": {
            "year": 1609
        },
        "event": "The Dutch East India Company establishes a factory in Hirado, Japan. VOC traders also make forays into South Sulawesi and Banjarmasin, Borneo"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "Pedro de Peralta, governor of New Mexico, establishes the settlement of Santa Fe"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "The Polish–Lithuanian Commonwealth army defeats combined Russian- Swedish forces at the Battle of Klushino and conquers Moscow"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "The VOC appoints Pieter Both as its first Governor-General to enable firmer control of their affairs in Asia. Previously all business had (in theory) required the approval of the Heeren XVII, a group of seventeen shareholders in Amsterdam"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "Ottoman Grand Vizier Kuyucu Murad Pasha is able to crush the major remnants of the Jelali Revolts, bringing an end to general anarchy in Anatolia"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "Matteo Ricci dies in Beijing"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "Panembahan Seda ing Krapyak of Mataram in Central Java attacks Surabaya, a major power on the north coast"
    },
    {
        "start": {
            "year": 1610
        },
        "event": "King Henry IV of France is assassinated by François Ravaillac"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "The Pontifical and Royal University of Santo Tomas, the oldest existing university in Asia, established by the Dominican Order in Manila"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "The English establish trading posts at Sukadana (southwest Kalimantan), Makassar, Jayakarta and Jepara in Java, and Aceh, Pariaman and Jambi in (Sumatra) threatening Dutch ambitions for a monopoly on East Indies trade"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "The Kingdom of Gowa ends its major push to convert the Makassarese and Bugis in South Sulawesi to Islam"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "The Dutch establish a post at Jayakarta (later 'Batavia' and then 'Jakarta')"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "A Dutch trader is killed in Banjarmasin and the Dutch East India Trading Company sacks the city"
    },
    {
        "start": {
            "year": 1611
        },
        "event": "The first publication of the King James Bible"
    },
    {
        "start": {
            "year": 1612
        },
        "event": "Sultan Iskandar Muda of Aceh captures the North Sumatran port of Deli"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "The Time of Troubles in Russia ends with the establishment of the House of Romanov, which rules until 1917"
    },
    {
        "start": {
            "year": 1613
        },
        "end": {
            "year": 1617
        },
        "event": "Polish–Lithuanian Commonwealth is invaded by the Tatars dozens of times"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "The Dutch expel the Portuguese from their Solor fort, but won't stay for long"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "The Dutch East India Company makes its first forays into Timor"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "Sultan Iskandar Muda of Aceh captures the North Sumatran port of Aru, subjugating the Sultanate of Deli. This allows Aceh to focus its expansionary efforts on the Straits of Malacca. Iskandar Muda continues on to sack Johor and kidnap its Sultan's family, but is later forced to retreat back to Aceh"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "The Dutch East India Company is forced to evacuate Gresik because of the Mataram siege of neighboring Surabaya. The VOC enters into negotiations with Mataram and is allowed to set up a trading post in Jepara"
    },
    {
        "start": {
            "year": 1613
        },
        "event": "Panembahan Seda ing Krapyak of Mataram dies and is succeeded by his son"
    },
    {
        "start": {
            "year": 1614
        },
        "event": "John Napier publishes Mirifici Logarithmorum Canonis Descriptio, the first table of logarithms"
    },
    {
        "start": {
            "year": 1614
        },
        "event": "Sultan Iskandar Muda of Aceh sinks a Portuguese fleet off of Bintan Island"
    },
    {
        "start": {
            "year": 1615
        },
        "event": "The Battle of Osaka (last major threat to Tokugawa Shogunate) ends"
    },
    {
        "start": {
            "year": 1615
        },
        "event": "A Dutch East India Company attack on Portuguese Malacca is repelled"
    },
    {
        "start": {
            "year": 1615
        },
        "event": "The Portuguese stop hiring Japanese mercenaries after a brawl in Malacca"
    },
    {
        "start": {
            "year": 1615
        },
        "event": "Panembahan ing Alaga of Mataram conquers the Eastern Salient of Java (the heartland of the old Majapahit Empire)"
    },
    {
        "start": {
            "year": 1615
        },
        "event": "The Dutch East India Company is in open hostilities with the Kingdom of Gowa, South Sulawesi"
    },
    {
        "start": {
            "year": 1616
        },
        "event": "The last remaining Moriscos (Moors who had nominally converted to Christianity) in Spain are expelled"
    },
    {
        "start": {
            "year": 1616
        },
        "event": "Death of retired Shogun Tokugawa Ieyasu"
    },
    {
        "start": {
            "year": 1616
        },
        "event": "English poet and playwright William Shakespeare dies"
    },
    {
        "start": {
            "year": 1617
        },
        "event": "Sultan Iskandar Muda of Aceh conquers Pahang on the South China Sea"
    },
    {
        "start": {
            "year": 1617
        },
        "event": "Panembahan ing Alaga of Mataram puts down a major revolt in Pajang"
    },
    {
        "start": {
            "year": 1618
        },
        "event": "The Defenestration of Prague"
    },
    {
        "start": {
            "year": 1618
        },
        "event": "The Bohemian Revolt precipitates the Thirty Years' War, which devastates Europe in the years 1618–48"
    },
    {
        "start": {
            "year": 1618
        },
        "event": "Bethlen Gabor, Prince of Transylvania joins Protestant Rebels"
    },
    {
        "start": {
            "year": 1618
        },
        "event": "The Manchus start invading China. Their conquest eventually topples the Ming Dynasty"
    },
    {
        "start": {
            "year": 1618
        },
        "event": "Dispute leads to the execution of Dutchmen in Mataram-controlled Jepara"
    },
    {
        "start": {
            "year": 1619
        },
        "event": "Bethlen Gabor is defeated outside Vienna"
    },
    {
        "start": {
            "year": 1619
        },
        "event": "Jan Pieterszoon Coen appointed Governor-General of the VOC who would show he had no scruples about using brute force to establish the VOC on a firm footing. While Ambon and Pattani had been the major VOC trading centers to this point, Coen is convinced that Dutch need a more central location near the Sunda Strait"
    },
    {
        "start": {
            "year": 1619
        },
        "event": "Dutch East India Company, English East India Company, and Sultanate of Banten all fighting over port city of Jayakarta. VOC forces storm the city and withstand a months-long siege by the combined English, Bantenese, and Jayakartan forces. They are relieved by Jan Pieterszoon Coen and a fleet of nineteen ships out of Ambon. Coen had burned Jepara and its EIC post along the way. The VOC levels the old city of Jayakarta and builds its new headquarters, Batavia, on top of it"
    },
    {
        "start": {
            "year": 1620
        },
        "event": "Emperor Ferdinand II defeats the Bohemian rebels in the Battle of White Mountain"
    },
    {
        "start": {
            "year": 1620
        },
        "event": "The Brownist Pilgrims arrive in the Mayflower at Cape Cod"
    },
    {
        "start": {
            "year": 1620
        },
        "end": {
            "year": 1621
        },
        "event": "Polish-Ottoman War over Moldavia"
    },
    {
        "start": {
            "year": 1620
        },
        "event": "Bethlen Gabor allies with the Ottomans and an invasion of Moldavia takes place. The Polish suffer a disaster at Cecora on the River Prut"
    },
    {
        "start": {
            "year": 1620
        },
        "event": "Almost the entire native population of Banda Islands was deported, driven away, starved to death or killed in an attempt to replace them with Dutch colonial slave labour"
    },
    {
        "start": {
            "year": 1620
        },
        "event": "Diplomatic agreements in Europe commence a three-year period of cooperation between the Dutch and the English over the spice trade"
    },
    {
        "start": {
            "year": 1621
        },
        "event": "The Battle of Chocim: Poles and Cossacks under Jan Karol Chodkiewicz defeat the Ottomans"
    },
    {
        "start": {
            "year": 1622
        },
        "event": "Capture of Ormuz; The island of Hormuz was captured by an Anglo-Persian force from Portuguese"
    },
    {
        "start": {
            "year": 1622
        },
        "event": "Jamestown massacre: Algonquian natives kill 347 English settlers outside Jamestown, Virginia (one-third of the colony's population) and burn the Henricus settlement"
    },
    {
        "start": {
            "year": 1623
        },
        "event": "Maffeo Barberini is elected Pope Urban VIII at the Papal conclave of 1623"
    },
    {
        "start": {
            "year": 1623
        },
        "event": "In a notorious but disputed incident, known as the 'Amboyna massacre', ten English and ten Japanese traders are arrested, tried and beheaded for conspiracy against the Dutch Government. The English quietly withdraw from most of their Indonesian activities (except trading in Bantam) and focus on other Asian interests"
    },
    {
        "start": {
            "year": 1624
        },
        "end": {
            "year": 1642
        },
        "event": "As chief minister, Cardinal Richelieu centralises power in France"
    },
    {
        "start": {
            "year": 1624
        },
        "event": "The Dutch West India Company invades the Portuguese colony of Bahia in Brazil"
    },
    {
        "start": {
            "year": 1625
        },
        "event": "New Amsterdam founded by the Dutch West India Company in North America"
    },
    {
        "start": {
            "year": 1626
        },
        "event": "St. Peter's Basilica in the Vatican completed"
    },
    {
        "start": {
            "year": 1627
        },
        "event": "Cardinal Richelieu lays siege to Protestant La Rochelle, which eventually capitulates"
    },
    {
        "start": {
            "year": 1627
        },
        "event": "Aurochs go extinct"
    },
    {
        "start": {
            "year": 1628
        },
        "event": "Sultan Agung of Mataram launched a failed campaign to conquer Dutch Batavia"
    },
    {
        "start": {
            "year": 1629
        },
        "event": "Abbas I, the Safavids king, died"
    },
    {
        "start": {
            "year": 1629
        },
        "event": "Cardinal Richelieu allies with Swedish Protestant forces in the Thirty Years' War to counter Ferdinand II's expansion"
    },
    {
        "start": {
            "year": 1629
        },
        "event": "Iskandar Muda of Aceh Sultanate launched a failed attempt to take Portuguese Malacca"
    },
    {
        "start": {
            "year": 1630
        },
        "event": "The Dutch West India Company invades the Portuguese colony of Pernambuco and founds Dutch Brazil"
    },
    {
        "start": {
            "year": 1631
        },
        "event": "Mount Vesuvius erupts"
    },
    {
        "start": {
            "year": 1632
        },
        "event": "Battle of Lützen, death of king of Sweden Gustav II Adolf"
    },
    {
        "start": {
            "year": 1632
        },
        "event": "Taj Mahal building work started in Agra, India"
    },
    {
        "start": {
            "year": 1633
        },
        "event": "Galileo Galilei arrives in Rome for his trial before the Inquisition"
    },
    {
        "start": {
            "year": 1633
        },
        "end": {
            "year": 1639
        },
        "event": "Japan transforms into \"locked country\""
    },
    {
        "start": {
            "year": 1634
        },
        "event": "Battle of Nördlingen results in Catholic victory"
    },
    {
        "start": {
            "year": 1634
        },
        "event": "Emperor Fasilides expels the Catholic Patriarch Afonso Mendes and several Jesuit missionaries from Ethiopia"
    },
    {
        "start": {
            "year": 1636
        },
        "event": "Emperor Fasilides founds the city of Gondar, which becomes the capital of Ethiopia for the next two centuries"
    },
    {
        "start": {
            "year": 1636
        },
        "event": "Harvard University is founded in Cambridge, Massachusetts"
    },
    {
        "start": {
            "year": 1636
        },
        "event": "The Portuguese are expelled again from their Solor fort by the Dutch following a reoccupation"
    },
    {
        "start": {
            "year": 1637
        },
        "event": "Shimabara Rebellion of Japanese Christians, rōnin and peasants against Edo"
    },
    {
        "start": {
            "year": 1637
        },
        "event": "René Descartes publishes \"Discours de la Méthode\" (\"The Discourse on the Method\") in French"
    },
    {
        "start": {
            "year": 1637
        },
        "event": "The first opera house, Teatro San Cassiano, opens in Venice"
    },
    {
        "start": {
            "year": 1637
        },
        "event": "Qing dynasty attacked Joseon dynasty"
    },
    {
        "start": {
            "year": 1639
        },
        "event": "Naval Battle of the Downs – Republic of the United Provinces fleet decisively defeats a Spanish fleet in English waters"
    },
    {
        "start": {
            "year": 1639
        },
        "event": "Disagreements between the Farnese and Barberini Pope Urban VIII escalate into the Wars of Castro and last until 1649"
    },
    {
        "start": {
            "year": 1639
        },
        "end": {
            "year": 1651
        },
        "event": "Wars of the Three Kingdoms, civil wars throughout Scotland, Ireland, and England"
    },
    {
        "start": {
            "year": 1640
        },
        "event": "King Charles was compelled to summon Parliament due to the revolt of the Scots"
    },
    {
        "start": {
            "year": 1640
        },
        "end": {
            "year": 1668
        },
        "event": "The Portuguese Restoration War led to the end of the Iberian Union"
    },
    {
        "start": {
            "year": 1640
        },
        "event": "Torture is outlawed in England"
    },
    {
        "start": {
            "year": 1641
        },
        "event": "The Tokugawa Shogunate institutes Sakoku- foreigners are expelled and no one is allowed to enter or leave Japan"
    },
    {
        "start": {
            "year": 1641
        },
        "event": "The Irish Rebellion"
    },
    {
        "start": {
            "year": 1641
        },
        "event": "René Descartes publishes Meditationes de prima philosophia Meditations on First Philosophy"
    },
    {
        "start": {
            "year": 1642
        },
        "event": "5th Dalai Lama swept power in Tibet, he established the theocratic state in Tibet after series battles against regional Kingdoms"
    },
    {
        "start": {
            "year": 1642
        },
        "event": "Dutch explorer Abel Janszoon Tasman achieves the first recorded European sighting of New Zealand"
    },
    {
        "start": {
            "year": 1642
        },
        "event": "Beginning of English Civil War, conflict will end in 1651 with the execution of King Charles I, abolishment of the monarchy and the establishment of the supremacy of Parliament over the king"
    },
    {
        "start": {
            "year": 1644
        },
        "event": "Giovanni Battista Pamphili is elected Pope Innocent X at the Papal conclave of 1644"
    },
    {
        "start": {
            "year": 1644
        },
        "event": "The Manchu conquer China ending the Ming Dynasty. The subsequent Qing Dynasty rules until 1912"
    },
    {
        "start": {
            "year": 1644
        },
        "end": {
            "year": 1674
        },
        "event": "The Mauritanian Thirty-Year War"
    },
    {
        "start": {
            "year": 1645
        },
        "event": "The death of Miyamoto Musashi, legendary Japanese Samurai warrior, of natural causes"
    },
    {
        "start": {
            "year": 1645
        },
        "end": {
            "year": 1669
        },
        "event": "Ottoman war with Venice. The Ottomans invade Crete and capture Canea"
    },
    {
        "start": {
            "year": 1646
        },
        "event": "Sultan Agung of Mataram dies – and is buried at his graveyard at Imogiri"
    },
    {
        "start": {
            "year": 1647
        },
        "event": "Seven-year-old Mehmed IV becomes sultan"
    },
    {
        "start": {
            "year": 1647
        },
        "end": {
            "year": 1652
        },
        "event": "The Great Plague of Seville"
    },
    {
        "start": {
            "year": 1648
        },
        "event": "The Peace of Westphalia ends the Thirty Years' War and the Eighty Years' War and marks the ends of Spain and the Holy Roman Empire as major European powers"
    },
    {
        "start": {
            "year": 1648
        },
        "end": {
            "year": 1653
        },
        "event": "Fronde civil war in France"
    },
    {
        "start": {
            "year": 1648
        },
        "end": {
            "year": 1657
        },
        "event": "The Khmelnytsky Uprising – a Cossack rebellion in Ukraine which turned into a Ukrainian war of liberation from Poland"
    },
    {
        "start": {
            "year": 1648
        },
        "end": {
            "year": 1667
        },
        "event": "The Deluge wars leave Polish–Lithuanian Commonwealth in ruins"
    },
    {
        "start": {
            "year": 1648
        },
        "end": {
            "year": 1669
        },
        "event": "The Ottomans capture Crete from the Venetians after the Siege of Candia"
    },
    {
        "start": {
            "year": 1649
        },
        "event": "King Charles I is executed for High treason, the first and only English king to be subjected to legal proceedings in a High Court of Justice and put to death"
    },
    {
        "start": {
            "year": 1649
        },
        "end": {
            "year": 1653
        },
        "event": "The Cromwellian conquest of Ireland"
    },
    {
        "start": {
            "year": 1650
        },
        "event": "Francesco Redi challenges the theory of spontaneous generation by demonstrating that maggots come from eggs of flies"
    },
    {
        "start": {
            "year": 1651
        },
        "event": "English Civil War ends with the Parliamentarian victory at the Battle of Worcester"
    },
    {
        "start": {
            "year": 1652
        },
        "event": "Cape Town founded by the Dutch East India Company in South Africa"
    },
    {
        "start": {
            "year": 1654
        },
        "end": {
            "year": 1661
        },
        "event": "Mehmed Köprülü is Grand Vizier"
    },
    {
        "start": {
            "year": 1655
        },
        "end": {
            "year": 1661
        },
        "event": "The Northern Wars cement Sweden's rise as a Great Power"
    },
    {
        "start": {
            "year": 1658
        },
        "event": "After his father Shah Jahan completes the Taj Mahal, his son Aurangzeb deposes him as ruler of the Mughal Empire"
    },
    {
        "start": {
            "year": 1660
        },
        "event": "The Commonwealth of England ends and the monarchy is brought back during the English Restoration"
    },
    {
        "start": {
            "year": 1660
        },
        "event": "Royal Society of London for the Improvement of Natural Knowledge founded"
    },
    {
        "start": {
            "year": 1661
        },
        "event": "Mehmed Köprülü dies and is succeeded by his son Ahmed"
    },
    {
        "start": {
            "year": 1661
        },
        "event": "The reign of the Kangxi Emperor of China begins"
    },
    {
        "start": {
            "year": 1661
        },
        "event": "Cardinal Mazarin, de-facto ruler of France, dies"
    },
    {
        "start": {
            "year": 1662
        },
        "event": "Koxinga captures Taiwan from the Dutch and founds the Kingdom of Tungning, which rules until 1683"
    },
    {
        "start": {
            "year": 1662
        },
        "event": "Jacques Aymar-Vernay, who later reintroduced Dowsing into popular use in Europe, is born"
    },
    {
        "start": {
            "year": 1663
        },
        "event": "Ottoman war against Habsburg Hungary"
    },
    {
        "start": {
            "year": 1663
        },
        "event": "France takes full political and military control over its colonial possessions in New France"
    },
    {
        "start": {
            "year": 1663
        },
        "event": "Robert Hooke discovers cells using a microscope"
    },
    {
        "start": {
            "year": 1664
        },
        "event": "The Battle of St. Gotthard: count Raimondo Montecuccoli defeats the Ottomans. The Peace of Vasvar – intended to keep the peace for 20 years"
    },
    {
        "start": {
            "year": 1664
        },
        "event": "British troops capture New Amsterdam and rename it New York"
    },
    {
        "start": {
            "year": 1664
        },
        "event": "John Evelyn's forestry book, Sylva, is published in England"
    },
    {
        "start": {
            "year": 1665
        },
        "event": "The Great Plague of London"
    },
    {
        "start": {
            "year": 1665
        },
        "event": "Portugal defeats the Kongo Empire at the Battle of Mbwila"
    },
    {
        "start": {
            "year": 1665
        },
        "end": {
            "year": 1667
        },
        "event": "The Second Anglo-Dutch War fought between England and the United Provinces"
    },
    {
        "start": {
            "year": 1666
        },
        "event": "The Great Fire of London"
    },
    {
        "start": {
            "year": 1667
        },
        "event": "The Raid on the Medway during the Second Anglo-Dutch War"
    },
    {
        "start": {
            "year": 1667
        },
        "end": {
            "year": 1668
        },
        "event": "The War of Devolution; France invades the Netherlands. The Peace of Aix-la-Chapelle (1668) brings this to a halt"
    },
    {
        "start": {
            "year": 1667
        },
        "end": {
            "year": 1699
        },
        "event": "The Great Turkish War halts the Ottoman Empire's expansion into Europe"
    },
    {
        "start": {
            "year": 1667
        },
        "event": "As a result of the Treaty of Breda between Dutch and England, the Dutch secured a worldwide monopoly on nutmeg by forcing England to give up their claim on Run, the most remote of the Banda Islands. While the Dutch did not press their claims on New Netherland"
    },
    {
        "start": {
            "year": 1668
        },
        "event": "Peace Treaty of Lisbon between Spain and Portugal recognizes Portugal as independent country"
    },
    {
        "start": {
            "year": 1669
        },
        "event": "The Ottomans capture Crete"
    },
    {
        "start": {
            "year": 1670
        },
        "event": "The Hudson's Bay Company is founded in Canada"
    },
    {
        "start": {
            "year": 1670
        },
        "event": "The city of Charleston is founded in present-day South Carolina"
    },
    {
        "start": {
            "year": 1672
        },
        "end": {
            "year": 1673
        },
        "event": "Ottoman campaign to help the Ukrainian Cossacks. John Sobieski defeats the Ottomans at the second battle of Khotyn (1673)"
    },
    {
        "start": {
            "year": 1672
        },
        "end": {
            "year": 1676
        },
        "event": "Polish-Ottoman War"
    },
    {
        "start": {
            "year": 1672
        },
        "event": "Rampjaar in the Netherlands – Combined attack by France, England and two German states on the Republic of the United Provinces"
    },
    {
        "start": {
            "year": 1672
        },
        "event": "Lynching of Johan de Witt and his brother Cornelis de Witt in the Hague – William III of Orange takes power"
    },
    {
        "start": {
            "year": 1672
        },
        "end": {
            "year": 1678
        },
        "event": "Franco-Dutch War"
    },
    {
        "start": {
            "year": 1673
        },
        "event": "Antoni van Leeuwenhoek is the first to observe microbes with a homemade microscope, using samples he collected from his teeth scrapings, raindrops, and his own feces. He calls them \"animalcules.\""
    },
    {
        "start": {
            "year": 1674
        },
        "event": "The Treaty of Westminster ends the war between England and the Republic of the United Provinces"
    },
    {
        "start": {
            "year": 1674
        },
        "event": "Maratha Empire founded in India by Shivaji"
    },
    {
        "start": {
            "year": 1676
        },
        "event": "The Treaty of Zurawno brings Polish-Ottoman hostilities to a halt"
    },
    {
        "start": {
            "year": 1676
        },
        "event": "Kara Mustafa becomes Grand Vizier"
    },
    {
        "start": {
            "year": 1676
        },
        "end": {
            "year": 1681
        },
        "event": "Russia and the Ottoman Empire commence the Russo-Turkish Wars"
    },
    {
        "start": {
            "year": 1678
        },
        "event": "The Treaty of Nijmegen ends various interconnected wars among France, the Dutch Republic, Spain, Brandenburg, Sweden, Denmark, the Prince-Bishopric of Münster, and the Holy Roman Empire"
    },
    {
        "start": {
            "year": 1680
        },
        "event": "The Pueblo Revolt drives the Spanish out of New Mexico until 1692"
    },
    {
        "start": {
            "year": 1681
        },
        "event": "The Pasha of Buda supports Imre Thököly's rebellion in Hungary"
    },
    {
        "start": {
            "year": 1682
        },
        "event": "Sultan Mehmed IV, advised by Kara Mustafa, decides to disregard the existing peace treaty with Leopold I, due to expire in 1684"
    },
    {
        "start": {
            "year": 1682
        },
        "end": {
            "year": 1683
        },
        "event": "The Ottomans make camp at Adrianople"
    },
    {
        "start": {
            "year": 1682
        },
        "event": "Peter the Great becomes joint ruler of Russia (sole tsar in 1696)"
    },
    {
        "start": {
            "year": 1682
        },
        "event": "La Salle explores the length of the Mississippi River and claims Louisiana for France"
    },
    {
        "start": {
            "year": 1683
        },
        "event": "China conquers the Kingdom of Tungning and annexes Taiwan"
    },
    {
        "start": {
            "year": 1683
        },
        "event": "A Habsburg council of war is held in Vienna"
    },
    {
        "start": {
            "year": 1683
        },
        "event": "The Battle of Vienna finishes the Ottoman Empire's hegemony in south-eastern Europe"
    },
    {
        "start": {
            "year": 1685
        },
        "event": "Edict of Fontainebleau outlaws Protestantism in France. King Charles II dies"
    },
    {
        "start": {
            "year": 1687
        },
        "event": "Isaac Newton publishes Philosophiae Naturalis Principia Mathematica"
    },
    {
        "start": {
            "year": 1688
        },
        "event": "The Siege of Derry"
    },
    {
        "start": {
            "year": 1688
        },
        "event": "Siamese revolution of 1688 ousted French influence and virtually severed all ties with the West until the 19th century"
    },
    {
        "start": {
            "year": 1688
        },
        "end": {
            "year": 1689
        },
        "event": "The Glorious Revolution starts with the Dutch Republic invading England, England becomes a constitutional monarchy"
    },
    {
        "start": {
            "year": 1688
        },
        "end": {
            "year": 1691
        },
        "event": "The War of the Two Kings in Ireland"
    },
    {
        "start": {
            "year": 1688
        },
        "end": {
            "year": 1697
        },
        "event": "The Grand Alliance sought to stop French expansion during the Nine Years War"
    },
    {
        "start": {
            "year": 1689
        },
        "event": "William ascends to the throne over England, Scotland, and Ireland"
    },
    {
        "start": {
            "year": 1689
        },
        "event": "John Locke publishes his first 'Letter Concerning Toleration'"
    },
    {
        "start": {
            "year": 1689
        },
        "event": "The Treaty of Nerchinsk established a border between Russia and China"
    },
    {
        "start": {
            "year": 1689
        },
        "event": "The Battle of Killiecrankie is fought between Jacobite and Williamite forces in Highland Perthshire"
    },
    {
        "start": {
            "year": 1689
        },
        "event": "The Karposh rebellion is crushed in present-day Republic of Macedonia, Skopje is retaken by the Ottoman Turks. Karposh is killed, and the rebels are defeated"
    },
    {
        "start": {
            "year": 1690
        },
        "event": "The Battle of the Boyne in Ireland"
    },
    {
        "start": {
            "year": 1692
        },
        "event": "Salem witch trials in Massachusetts"
    },
    {
        "start": {
            "year": 1692
        },
        "event": "Port Royal in Jamaica is destroyed by an earthquake and tsunami, estimated 2000 die, 2300 are injured"
    },
    {
        "start": {
            "year": 1692
        },
        "end": {
            "year": 1694
        },
        "event": "Famine in France kills 2 million"
    },
    {
        "start": {
            "year": 1693
        },
        "event": "The College of William and Mary is founded in Williamsburg, Virginia, by a royal charter"
    },
    {
        "start": {
            "year": 1694
        },
        "event": "The Bank of England is established"
    },
    {
        "start": {
            "year": 1694
        },
        "event": "Mary II of England dies"
    },
    {
        "start": {
            "year": 1695
        },
        "event": "The Mughal Empire nearly bans the East India Company in response to pirate Henry Every's capture of the Ganj-i-Sawai"
    },
    {
        "start": {
            "year": 1696
        },
        "end": {
            "year": 1697
        },
        "event": "Famine in Finland wipes out almost one-third of the population"
    },
    {
        "start": {
            "year": 1697
        },
        "event": "The earliest known first-class cricket match takes place in Sussex"
    },
    {
        "start": {
            "year": 1697
        },
        "end": {
            "year": 1699
        },
        "event": "Grand Embassy of Peter the Great"
    },
    {
        "start": {
            "year": 1699
        },
        "event": "The Treaty of Karlowitz ends the Great Turkish War"
    },
    {
        "start": {
            "year": 1699
        },
        "event": "Thomas Savery demonstrates his first steam engine to the Royal Society"
    },
    {
        "start": {
            "year": 1700
        },
        "event": "With the decline of the spice trade, textiles are now the most important trade item in the Dutch East Indies"
    }
]