[
    {
        "start": {
            "year": 1801
        },
        "event": "Giuseppe Piazzi discovers the dwarf planet Ceres"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "Thomas Jefferson elected President of the United States by the House of Representatives, following a tie in the Electoral College"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "The Kingdom of Great Britain and the Kingdom of Ireland merge to form the United Kingdom"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "Ranjit Singh crowned as King of Punjab"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "Napoleon signs the Concordat of 1801 with the Pope"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "Cairo falls to the British"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "Assassination of Tsar Paul I of Russia"
    },
    {
        "start": {
            "year": 1801
        },
        "event": "British defeat French at the Second Battle of Abukir"
    },
    {
        "start": {
            "year": 1801
        },
        "end": {
            "year": 1815
        },
        "event": "the First Barbary War and the Second Barbary War between the United States and the Barbary States of North Africa"
    },
    {
        "start": {
            "year": 1802
        },
        "event": "Treaty of Amiens between France and the United Kingdom ends the War of the Second Coalition"
    },
    {
        "start": {
            "year": 1802
        },
        "event": "Ludwig van Beethoven performs his Moonlight Sonata for the first time"
    },
    {
        "start": {
            "year": 1803
        },
        "event": "William Symington demonstrates his Charlotte Dundas, the \"first practical steamboat\""
    },
    {
        "start": {
            "year": 1803
        },
        "event": "The United States more than doubles in size when it buys out France's territorial claims in North America via the Louisiana Purchase. This begins the U.S.'s westward expansion to the Pacific referred to as its Manifest Destiny which involves annexing and conquering land from Mexico, Britain, and Native Americans"
    },
    {
        "start": {
            "year": 1803
        },
        "event": "The Wahhabis of the First Saudi State capture Mecca and Medina"
    },
    {
        "start": {
            "year": 1803
        },
        "event": "War breaks out between Britain and France; this is considered by some to be the beginning of the Napoleonic Wars"
    },
    {
        "start": {
            "year": 1803
        },
        "event": "First phase of Padri War"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "Haiti gains independence from France and becomes the first black republic"
    },
    {
        "start": {
            "year": 1804
        },
        "end": {
            "year": 1813
        },
        "event": "Russo-Persian War"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "Austrian Empire founded by Francis I"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "Napoleon crowns himself Emperor of the French"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "World population reaches 1 billion"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "First steam locomotive begins operation"
    },
    {
        "start": {
            "year": 1804
        },
        "event": "Morphine first isolated"
    },
    {
        "start": {
            "year": 1804
        },
        "end": {
            "year": 1810
        },
        "event": "Fulani Jihad in Nigeria"
    },
    {
        "start": {
            "year": 1804
        },
        "end": {
            "year": 1815
        },
        "event": "Serbian revolution erupts against the Ottoman rule. Suzerainty of Serbia recognized in 1817"
    },
    {
        "start": {
            "year": 1805
        },
        "event": "The Battle of Trafalgar eliminates the French and Spanish naval fleets and allows for British dominance of the seas, a major factor for the success of the British Empire later in the century"
    },
    {
        "start": {
            "year": 1805
        },
        "event": "Napoleon decisively defeats an Austrian-Russian army at the Battle of Austerlitz"
    },
    {
        "start": {
            "year": 1805
        },
        "end": {
            "year": 1848
        },
        "event": "Muhammad Ali modernizes Egypt"
    },
    {
        "start": {
            "year": 1806
        },
        "event": "Holy Roman Empire dissolved as a consequence of the Treaty of Pressburg"
    },
    {
        "start": {
            "year": 1806
        },
        "event": "Cape Colony becomes part of the British Empire"
    },
    {
        "start": {
            "year": 1806
        },
        "end": {
            "year": 1812
        },
        "event": "Russo-Turkish War, Treaty of Bucharest"
    },
    {
        "start": {
            "year": 1807
        },
        "event": "Britain declares the Slave Trade illegal"
    },
    {
        "start": {
            "year": 1807
        },
        "event": "Potassium and Sodium are individually isolated by Sir Humphry Davy"
    },
    {
        "start": {
            "year": 1808
        },
        "event": "Beethoven performs his Fifth Symphony"
    },
    {
        "start": {
            "year": 1808
        },
        "end": {
            "year": 1809
        },
        "event": "Russia conquers Finland from Sweden in the Finnish War"
    },
    {
        "start": {
            "year": 1808
        },
        "end": {
            "year": 1814
        },
        "event": "Spanish guerrillas fight in the Peninsular War"
    },
    {
        "start": {
            "year": 1808
        },
        "event": "Herman Willem Daendels the Governor-general of the Dutch East Indies (1808–1811) begin the construction of Java Great Post Road."
    },
    {
        "start": {
            "year": 1809
        },
        "event": "Napoleon strips the Teutonic Knights of their last holdings in Bad Mergentheim"
    },
    {
        "start": {
            "year": 1819
        },
        "event": "29 January, Stamford Raffles arrives in Singapore with William Farquhar to establish a trading post for the British East India Company. 8 February, The treaty is signed between Sultan Hussein of Johor, Temenggong Abdul Rahman and Stamford Raffles. Farquhar is installed as the first Resident of the settlement"
    },
    {
        "start": {
            "year": 1810
        },
        "event": "The University of Berlin was founded. Among its students and faculty are Hegel, Marx, and Bismarck. The German university reform proves to be so successful that its model is copied around the world (see History of European research universities)"
    },
    {
        "start": {
            "year": 1810
        },
        "event": "The Grito de Dolores begins the Mexican War of Independence"
    },
    {
        "start": {
            "year": 1810
        },
        "event": "The trumpet gets valves"
    },
    {
        "start": {
            "year": 1810
        },
        "end": {
            "year": 1820
        },
        "event": "Most of the Latin American colonies free themselves from the Spanish and Portuguese Empires after the Latin American wars of independence"
    },
    {
        "start": {
            "year": 1812
        },
        "event": "The French invasion of Russia is a turning point in the Napoleonic Wars"
    },
    {
        "start": {
            "year": 1812
        },
        "event": "British Prime Minister Spencer Perceval is assassinated"
    },
    {
        "start": {
            "year": 1812
        },
        "end": {
            "year": 1815
        },
        "event": "War of 1812 between the United States and Britain; ends in a draw, except that Native Americans lose power"
    },
    {
        "start": {
            "year": 1813
        },
        "event": "Jane Austen publishes Pride and Prejudice"
    },
    {
        "start": {
            "year": 1814
        },
        "event": "Napoleon abdicates and is exiled to Elba"
    },
    {
        "start": {
            "year": 1814
        },
        "event": "Elisha Collier invents the Flintlock Revolver"
    },
    {
        "start": {
            "year": 1813
        },
        "end": {
            "year": 1907
        },
        "event": "The contest between the British Empire and Imperial Russia for control of Central Asia is referred to as the Great Game"
    },
    {
        "start": {
            "year": 1814
        },
        "end": {
            "year": 1816
        },
        "event": "Anglo-Nepalese War between Nepal (Gurkha Empire) and British Empire"
    },
    {
        "start": {
            "year": 1815
        },
        "event": "The Congress of Vienna redraws the European map. Reaction And conservatism dominate all of Europe. The Concert of Europe attempts to preserve this settlement, but the forces of liberalism and nationalism make for dramatic changes. It marks the beginning of a Pax Britannica which lasts until 1914"
    },
    {
        "start": {
            "year": 1815
        },
        "event": "Napoleon escapes exile and begins the Hundred Days before finally being defeated at the Battle of Waterloo and exiled to St Helena. His defeat brings a conclusion to the Napoleonic Wars"
    },
    {
        "start": {
            "year": 1815
        },
        "event": "April, Mount Tambora in Sumbawa island erupts, becoming the largest volcanic eruption in recorded history, destroying Tambora culture, and killing at least 71,000 people, including its aftermath. The eruption created global climate anomalies known as \"volcanic winter\"."
    },
    {
        "start": {
            "year": 1815
        },
        "event": "Jane Austen publishes Emma in December"
    },
    {
        "start": {
            "year": 1816
        },
        "event": "Year Without a Summer: Unusually cold conditions wreak havoc throughout the Northern Hemisphere, likely influenced by the 1815 explosion of Mount Tambora"
    },
    {
        "start": {
            "year": 1816
        },
        "event": "Independence of Argentina"
    },
    {
        "start": {
            "year": 1816
        },
        "end": {
            "year": 1828
        },
        "event": "Shaka's Zulu Kingdom becomes the largest in Southern Africa"
    },
    {
        "start": {
            "year": 1817
        },
        "event": "Principality of Serbia becomes suzerain from the Ottoman Empire. Officially independent in 1867"
    },
    {
        "start": {
            "year": 1817
        },
        "event": "First Seminole War begins in Florida"
    },
    {
        "start": {
            "year": 1817
        },
        "event": "Russia commences its conquest of the Caucasus"
    },
    {
        "start": {
            "year": 1817
        },
        "event": "Princess Charlotte of Wales dies following childbirth"
    },
    {
        "start": {
            "year": 1818
        },
        "event": "Mary Shelley publishes Frankenstein"
    },
    {
        "start": {
            "year": 1818
        },
        "event": "Independence of Chile"
    },
    {
        "start": {
            "year": 1819
        },
        "event": "John Keats writes his odes of 1819"
    },
    {
        "start": {
            "year": 1819
        },
        "event": "Peterloo massacre in England"
    },
    {
        "start": {
            "year": 1819
        },
        "event": "The modern city of Singapore is established by the British East India Company"
    },
    {
        "start": {
            "year": 1819
        },
        "event": "Théodore Géricault paints his masterpiece The Raft of the Medusa, and exhibits it in the French Salon of 1819 at the Louvre"
    },
    {
        "start": {
            "year": 1816
        },
        "event": "Shaka rises to power over the Zulu Kingdom. Zulu expansion was a major factor of the Mfecane (“Crushing”) that depopulated large areas of southern Africa"
    },
    {
        "start": {
            "year": 1820
        },
        "event": "Missouri Compromise"
    },
    {
        "start": {
            "year": 1820
        },
        "event": "Regency period ends in the United Kingdom"
    },
    {
        "start": {
            "year": 1820
        },
        "event": "Discovery of Antarctica"
    },
    {
        "start": {
            "year": 1820
        },
        "event": "Liberia founded by the American Colonization Society for freed American slaves"
    },
    {
        "start": {
            "year": 1820
        },
        "event": "Dissolution of the Maratha Empire"
    },
    {
        "start": {
            "year": 1820
        },
        "end": {
            "year": 1835
        },
        "event": "At least 5000 Mexicans die in Apache raids, and 100 settlements are destroyed."
    },
    {
        "start": {
            "year": 1821
        },
        "event": "Napoleon Bonaparte dies in exile on the island of Saint Helena"
    },
    {
        "start": {
            "year": 1821
        },
        "event": "Mexico gains independence from Spain with the Treaty of Córdoba"
    },
    {
        "start": {
            "year": 1821
        },
        "event": "Peru declares its independence from Spain"
    },
    {
        "start": {
            "year": 1821
        },
        "event": "Navarino Massacre"
    },
    {
        "start": {
            "year": 1821
        },
        "end": {
            "year": 1830
        },
        "event": "Greece becomes the first country to break away from the Ottoman Empire after the Greek War of Independence"
    },
    {
        "start": {
            "year": 1822
        },
        "end": {
            "year": 1823
        },
        "event": "First Mexican Empire, as Mexico's first post-independent government, ruled by Emperor Agustín I of Mexico"
    },
    {
        "start": {
            "year": 1822
        },
        "event": "Prince Pedro of Brazil proclaimed the Brazilian independence on 7 September. On 1 December, he was crowned as Emperor Dom Pedro I of Brazil"
    },
    {
        "start": {
            "year": 1823
        },
        "end": {
            "year": 1887
        },
        "event": "The British Empire annexed Burma (now also called Myanmar) after three Anglo-Burmese Wars"
    },
    {
        "start": {
            "year": 1823
        },
        "event": "Monroe Doctrine declared by US President James Monroe"
    },
    {
        "start": {
            "year": 1824
        },
        "event": "Premiere of Beethoven's Ninth Symphony"
    },
    {
        "start": {
            "year": 1824
        },
        "event": "Cadbury is established in Birmingham"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "Erie Canal opened connecting the Great Lakes to the Atlantic Ocean"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "First isolation of aluminum"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "Independence of Bolivia"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "The Stockton and Darlington Railway, the first public railway in the world, is opened"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "The Decembrist revolt"
    },
    {
        "start": {
            "year": 1825
        },
        "end": {
            "year": 1828
        },
        "event": "The Cisplatine War results in the independence of Uruguay"
    },
    {
        "start": {
            "year": 1825
        },
        "event": "Java War. (to 1830)"
    },
    {
        "start": {
            "year": 1826
        },
        "event": "Samuel Morey patents the internal combustion engine"
    },
    {
        "start": {
            "year": 1826
        },
        "end": {
            "year": 1828
        },
        "event": "After the final Russo-Persian War, the Persian Empire took back territory lost to Russia from the previous war"
    },
    {
        "start": {
            "year": 1827
        },
        "event": "Death of William Blake, Ludwig van Beethoven"
    },
    {
        "start": {
            "year": 1828
        },
        "end": {
            "year": 1832
        },
        "event": "Black War in Tasmania leads to the near extinction of the Tasmanian aborigines"
    },
    {
        "start": {
            "year": 1829
        },
        "event": "Johann Wolfgang von Goethe's Faust premieres"
    },
    {
        "start": {
            "year": 1829
        },
        "event": "First electric motor built"
    },
    {
        "start": {
            "year": 1829
        },
        "event": "Sir Robert Peel founds the Metropolitan Police Service, the first modern police force"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "The Church of Jesus Christ of Latter Day Saints is established on 6 April 1830"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "July Revolution in France"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "The Belgian Revolution in the United Kingdom of the Netherlands led to the creation of Belgium"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "Greater Colombia dissolved and the nations of Colombia (including modern-day Panama), Ecuador, and Venezuela took its place"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "November Uprising in Poland against Russia"
    },
    {
        "start": {
            "year": 1830
        },
        "event": "End of the Diponegoro war. The whole area of Yogyakarta and Surakarta Manca nagara Dutch seized. 27 September, Klaten Agreement determines a fixed boundary between Surakarta and Yogyakarta and permanently divide the kingdom of Mataram was signed by Sasradiningrat, Pepatih Dalem Surakarta, and Danurejo, Pepatih Dalem Yogyakarta. Mataram is a de facto and de yure controlled by the Dutch East Indies"
    },
    {
        "start": {
            "year": 1831
        },
        "event": "France invades and occupies Algeria"
    },
    {
        "start": {
            "year": 1831
        },
        "event": "Ioannis Kapodistrias, the First Governor of Greece is murdered at Nauplion"
    },
    {
        "start": {
            "year": 1831
        },
        "event": "The Belgian constitution is ratified and Leopold I is crowned as first \"King of the Belgians\""
    },
    {
        "start": {
            "year": 1831
        },
        "event": "Great Bosnian uprising against Ottoman rule occurs"
    },
    {
        "start": {
            "year": 1831
        },
        "end": {
            "year": 1836
        },
        "event": "Charles Darwin's journey on the HMS Beagle"
    },
    {
        "start": {
            "year": 1831
        },
        "event": "November Uprising ends with crushing defeat for Poland in the Battle of Warsaw"
    },
    {
        "start": {
            "year": 1831
        },
        "end": {
            "year": 1833
        },
        "event": "Egyptian–Ottoman War"
    },
    {
        "start": {
            "year": 1831
        },
        "event": "Second phase of Padri War. (to 1838)"
    },
    {
        "start": {
            "year": 1832
        },
        "event": "The British Parliament passes the Great Reform Act"
    },
    {
        "start": {
            "year": 1833
        },
        "event": "Slavery Abolition Act bans slavery throughout the British Empire"
    },
    {
        "start": {
            "year": 1833
        },
        "end": {
            "year": 1876
        },
        "event": "Carlist Wars in Spain"
    },
    {
        "start": {
            "year": 1834
        },
        "event": "The German Customs Union is formed"
    },
    {
        "start": {
            "year": 1834
        },
        "event": "Spanish Inquisition officially ends"
    },
    {
        "start": {
            "year": 1834
        },
        "event": "Britain amends the Poor Law demanding that any paupers requesting assistance must go to a workhouse"
    },
    {
        "start": {
            "year": 1834
        },
        "end": {
            "year": 1859
        },
        "event": "Imam Shamil's rebellion in Russian-occupied Caucasus"
    },
    {
        "start": {
            "year": 1835
        },
        "end": {
            "year": 1836
        },
        "event": "The Texas Revolution in Mexico resulted in the short-lived Republic of Texas"
    },
    {
        "start": {
            "year": 1836
        },
        "event": "Battle of the Alamo ends with defeat for Texan separatists"
    },
    {
        "start": {
            "year": 1836
        },
        "event": "Battle of San Jacinto leads to the capture of General Santa Anna"
    },
    {
        "start": {
            "year": 1836
        },
        "event": "Samuel Colt popularizes the revolver and sets up a firearms company to manufacture his invention of the Colt Paterson revolver a six bullets firearm shot one by one without reloading manually"
    },
    {
        "start": {
            "year": 1837
        },
        "event": "Telegraphy patented"
    },
    {
        "start": {
            "year": 1837
        },
        "event": "Charles Dickens publishes Oliver Twist"
    },
    {
        "start": {
            "year": 1837
        },
        "event": "Death of Alexander Pushkin"
    },
    {
        "start": {
            "year": 1837
        },
        "end": {
            "year": 1838
        },
        "event": "Rebellions of 1837 in Canada"
    },
    {
        "start": {
            "year": 1837
        },
        "end": {
            "year": 1901
        },
        "event": "Queen Victoria's reign is considered the apex of the British Empire and is referred to as the Victorian era"
    },
    {
        "start": {
            "year": 1838
        },
        "event": "By this time, 46,000 Native Americans have been forcibly relocated in the Trail of Tears"
    },
    {
        "start": {
            "year": 1838
        },
        "end": {
            "year": 1840
        },
        "event": "Civil war in the Federal Republic of Central America led to the foundings of Guatemala, El Salvador, Honduras, Nicaragua, and Costa Rica"
    },
    {
        "start": {
            "year": 1839
        },
        "event": "Kingdom of Belgium declared"
    },
    {
        "start": {
            "year": 1839
        },
        "end": {
            "year": 1851
        },
        "event": "Uruguayan Civil War"
    },
    {
        "start": {
            "year": 1839
        },
        "end": {
            "year": 1860
        },
        "event": "After the First and Second Opium Wars, France, the United Kingdom, the United States and Russia gain many trade and associated concessions from China resulting in the start of the decline of the Qing dynasty"
    },
    {
        "start": {
            "year": 1839
        },
        "end": {
            "year": 1919
        },
        "event": "Anglo-Afghan Wars lead to stalemate and the establishment of the Durand line"
    },
    {
        "start": {
            "year": 1840
        },
        "event": "New Zealand is founded, as the Treaty of Waitangi is signed by the Māori and British"
    },
    {
        "start": {
            "year": 1840
        },
        "event": "Upper and Lower Canada are merged into the Province of Canada"
    },
    {
        "start": {
            "year": 1841
        },
        "event": "The word \"dinosaur\" is coined by Richard Owen"
    },
    {
        "start": {
            "year": 1842
        },
        "event": "Treaty of Nanking cedes Hong Kong to the British"
    },
    {
        "start": {
            "year": 1842
        },
        "event": "Anaesthesia used for the first time"
    },
    {
        "start": {
            "year": 1843
        },
        "event": "The first wagon train sets out from Missouri"
    },
    {
        "start": {
            "year": 1843
        },
        "event": "Short stories A Christmas Carol and The Tell-Tale Heart published"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "Persian Prophet the Báb announces his revelation on 23 May, founding Bábísm. He announced to the world of the coming of \"He whom God shall make manifest\". He is considered the forerunner of Bahá'u'lláh, the founder of the Bahá'í Faith"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "First publicly funded telegraph line in the world—between Baltimore and Washington—sends demonstration message on 24 May, ushering in the age of the telegraph. This message read \"What hath God wrought?\" (Bible, Numbers 23:23)"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "Millerite movement awaits the Second Advent of Jesus Christ on 22 October. Christ's non-appearance becomes known as the Great Disappointment"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "The great auk is rendered extinct"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "Dominican War of Independence from Haiti"
    },
    {
        "start": {
            "year": 1844
        },
        "event": "Heinrich Heine coins the term \"Lisztomania\" in regards to the public's frenzied reaction to the pianist Franz Liszt"
    },
    {
        "start": {
            "year": 1845
        },
        "event": "Unification of the Kingdom of Tonga under Tāufaʻāhau (King George Tupou I)"
    },
    {
        "start": {
            "year": 1845
        },
        "event": "Lunacy Act 1845 passes through Parliament"
    },
    {
        "start": {
            "year": 1845
        },
        "end": {
            "year": 1846
        },
        "event": "First Anglo-Sikh War"
    },
    {
        "start": {
            "year": 1845
        },
        "end": {
            "year": 1872
        },
        "event": "The New Zealand Land Wars"
    },
    {
        "start": {
            "year": 1845
        },
        "end": {
            "year": 1849
        },
        "event": "The Irish Potato Famine leads to the Irish diaspora"
    },
    {
        "start": {
            "year": 1846
        },
        "end": {
            "year": 1848
        },
        "event": "The Mexican-American War leads to Mexico's cession of much of the modern-day Southwestern United States"
    },
    {
        "start": {
            "year": 1846
        },
        "end": {
            "year": 1847
        },
        "event": "Mormon migration to Utah"
    },
    {
        "start": {
            "year": 1847
        },
        "event": "The Brontë sisters publish Jane Eyre, Wuthering Heights and Agnes Grey"
    },
    {
        "start": {
            "year": 1847
        },
        "end": {
            "year": 1901
        },
        "event": "The Caste War of Yucatán"
    },
    {
        "start": {
            "year": 1848
        },
        "end": {
            "year": 1849
        },
        "event": "Second Anglo-Sikh War"
    },
    {
        "start": {
            "year": 1848
        },
        "event": "The Communist Manifesto published"
    },
    {
        "start": {
            "year": 1848
        },
        "event": "Revolutions of 1848 in Europe"
    },
    {
        "start": {
            "year": 1848
        },
        "event": "Seneca Falls Convention is the first women's rights convention in the United States and leads to the battle for women's suffrage"
    },
    {
        "start": {
            "year": 1848
        },
        "end": {
            "year": 1858
        },
        "event": "California Gold Rush"
    },
    {
        "start": {
            "year": 1848
        },
        "event": "William Holman Hunt, John Everett Millais and Dante Gabriel Rossetti found the Pre-Raphaelite Brotherhood"
    },
    {
        "start": {
            "year": 1849
        },
        "event": "The first boatloads of gold prospectors arrive in California, giving them the nickname 49ers"
    },
    {
        "start": {
            "year": 1849
        },
        "event": "Roman Republic's constitutional law becomes the first to abolish capital punishment"
    },
    {
        "start": {
            "year": 1849
        },
        "event": "The safety pin and the gas mask are invented"
    },
    {
        "start": {
            "year": 1849
        },
        "event": "Earliest recorded air raid, as Austria employs 200 balloons to deliver ordnance against Venice"
    },
    {
        "start": {
            "year": 1850
        },
        "event": "The Little Ice Age ends around this time"
    },
    {
        "start": {
            "year": 1850
        },
        "event": "Alfred Tennyson is appointed Poet Laureate after the death of William Wordsworth"
    },
    {
        "start": {
            "year": 1850
        },
        "end": {
            "year": 1864
        },
        "event": "Taiping Rebellion is the bloodiest conflict of the century, leading to the deaths of 20 million people"
    },
    {
        "start": {
            "year": 1851
        },
        "event": "The Great Exhibition in London was the world's first international Expo or World Fair"
    },
    {
        "start": {
            "year": 1851
        },
        "event": "Louis Napoleon assumes power in France in a coup"
    },
    {
        "start": {
            "year": 1851
        },
        "end": {
            "year": 1852
        },
        "event": "The Platine War ends and the Empire of Brazil has the hegemony over South America"
    },
    {
        "start": {
            "year": 1851
        },
        "end": {
            "year": 1860
        },
        "event": "Victorian gold rush in Australia"
    },
    {
        "start": {
            "year": 1851
        },
        "event": "Herman Melville publishes Moby-Dick"
    },
    {
        "start": {
            "year": 1852
        },
        "event": "Frederick Douglass delivers his speech \"The Meaning of July Fourth for the Negro\" in Rochester, New York"
    },
    {
        "start": {
            "year": 1853
        },
        "event": "United States Commodore Matthew C. Perry threatens the Japanese capital Edo with gunships, demanding that they agree to open trade"
    },
    {
        "start": {
            "year": 1853
        },
        "end": {
            "year": 1856
        },
        "event": "Crimean War between France, the United Kingdom, the Ottoman Empire and Russia"
    },
    {
        "start": {
            "year": 1854
        },
        "event": "Battle of Balaclava and the Charge of the Light Brigade"
    },
    {
        "start": {
            "year": 1854
        },
        "event": "The Convention of Kanagawa formally ends Japan's policy of isolation"
    },
    {
        "start": {
            "year": 1854
        },
        "event": "SS Arctic disaster: The steamship SS Arctic collides with the SS Vesta and sinks off the coast of Newfoundland"
    },
    {
        "start": {
            "year": 1854
        },
        "end": {
            "year": 1855
        },
        "event": "Siege of Sevastapol; city falls to French and British forces"
    },
    {
        "start": {
            "year": 1855
        },
        "event": "Bessemer process enables steel to be mass-produced"
    },
    {
        "start": {
            "year": 1855
        },
        "event": "Walt Whitman publishes the first edition of Leaves of Grass"
    },
    {
        "start": {
            "year": 1855
        },
        "event": "Cocaine is isolated by Friedrich Gaedcke"
    },
    {
        "start": {
            "year": 1856
        },
        "event": "Rana dynasty of Nepal established by Jung Bahadur Rana"
    },
    {
        "start": {
            "year": 1856
        },
        "event": "World's first oil refinery in Romania"
    },
    {
        "start": {
            "year": 1856
        },
        "event": "Neanderthal man first identified. Age still unknown"
    },
    {
        "start": {
            "year": 1857
        },
        "event": "Sir Joseph Whitworth designs the first long-range sniper rifle"
    },
    {
        "start": {
            "year": 1857
        },
        "end": {
            "year": 1858
        },
        "event": "Indian Rebellion of 1857. The British Empire assumes control of India from the East India Company"
    },
    {
        "start": {
            "year": 1858
        },
        "end": {
            "year": 1947
        },
        "event": "British Empire in India lasts for 90 years"
    },
    {
        "start": {
            "year": 1858
        },
        "event": "Invention of the phonautograph, the first true device for recording sound"
    },
    {
        "start": {
            "year": 1858
        },
        "event": "Construction of Big Ben is completed"
    },
    {
        "start": {
            "year": 1859
        },
        "event": "Charles Darwin publishes On the Origin of Species"
    },
    {
        "start": {
            "year": 1859
        },
        "end": {
            "year": 1869
        },
        "event": "Suez Canal is constructed"
    },
    {
        "start": {
            "year": 1860
        },
        "event": "Giuseppe Garibaldi launches the Expedition of the Thousand"
    },
    {
        "start": {
            "year": 1860
        },
        "event": "The Pony Express started"
    },
    {
        "start": {
            "year": 1861
        },
        "end": {
            "year": 1865
        },
        "event": "American Civil War between the Union and seceding Confederacy"
    },
    {
        "start": {
            "year": 1861
        },
        "event": "Russia abolishes serfdom"
    },
    {
        "start": {
            "year": 1861
        },
        "end": {
            "year": 1867
        },
        "event": "French intervention in Mexico and the creation of the Second Mexican Empire, ruled by Maximilian I of Mexico and his consort Carlota of Mexico"
    },
    {
        "start": {
            "year": 1861
        },
        "event": "Death of Prince Albert"
    },
    {
        "start": {
            "year": 1861
        },
        "event": "James Clerk Maxwell publishes On Physical Lines of Force, formulating the four Maxwell's Equations"
    },
    {
        "start": {
            "year": 1862
        },
        "event": "The Pony Express ended"
    },
    {
        "start": {
            "year": 1862
        },
        "event": "Victor Hugo publishes Les Misérables"
    },
    {
        "start": {
            "year": 1862
        },
        "event": "French gain first foothold in Southeast Asia"
    },
    {
        "start": {
            "year": 1862
        },
        "end": {
            "year": 1877
        },
        "event": "Muslim Rebellion in north-west China"
    },
    {
        "start": {
            "year": 1863
        },
        "event": "Bahá'u'lláh declares his station as \"He whom God shall make manifest\". This date is celebrated in the Bahá'í Faith as The Festival of Ridván"
    },
    {
        "start": {
            "year": 1863
        },
        "event": "Formation of the International Red Cross is followed by the adoption of the First Geneva Convention in 1864"
    },
    {
        "start": {
            "year": 1863
        },
        "event": "First section of the London Underground opens"
    },
    {
        "start": {
            "year": 1863
        },
        "event": "France annexes Cambodia"
    },
    {
        "start": {
            "year": 1863
        },
        "event": "Édouard Manet exhibits his painting The Luncheon on the Grass, sparking public outrage"
    },
    {
        "start": {
            "year": 1863
        },
        "end": {
            "year": 1865
        },
        "event": "Polish uprising against the Russian Empire"
    },
    {
        "start": {
            "year": 1864
        },
        "event": "Circassian Genocide.(21 May 1864)"
    },
    {
        "start": {
            "year": 1864
        },
        "end": {
            "year": 1866
        },
        "event": "The Chincha Islands War was an attempt by Spain to regain its South American colonies"
    },
    {
        "start": {
            "year": 1864
        },
        "end": {
            "year": 1870
        },
        "event": "The Paraguayan War ends Paraguayan ambitions for expansion and destroys much of the Paraguayan population"
    },
    {
        "start": {
            "year": 1864
        },
        "event": "June, The first railway track in Indonesia was laid between Semarang and Tanggung, Central Java by the Dutch colonial government."
    },
    {
        "start": {
            "year": 1865
        },
        "end": {
            "year": 1877
        },
        "event": "Reconstruction in the United States; Slavery is banned in the United States by the Thirteenth Amendment to the United States Constitution"
    },
    {
        "start": {
            "year": 1865
        },
        "end": {
            "year": 1865
        },
        "event": "Robert E. Lee surrenders the Army of Northern Virginia (26,765 troops) to Ulysses S. Grant at Appomattox Courthouse, Virginia, effectively ending the American Civil War"
    },
    {
        "start": {
            "year": 1865
        },
        "end": {
            "year": 1865
        },
        "event": "United States President Abraham Lincoln is assassinated by actor and Confederate sympathiser John Wilkes Booth, while attending a performance at Ford's Theater, Washington, D.C.. He dies approximately nine hours after being shot on 15 April 1865"
    },
    {
        "start": {
            "year": 1865
        },
        "event": "Gregor Mendel formulates his laws of inheritance"
    },
    {
        "start": {
            "year": 1865
        },
        "event": "Lewis Carroll publishes Alice's Adventures in Wonderland"
    },
    {
        "start": {
            "year": 1866
        },
        "event": "Successful transatlantic telegraph cable follows an earlier attempt in 1858"
    },
    {
        "start": {
            "year": 1866
        },
        "event": "Austro-Prussian War results in the dissolution of the German Confederation and the creation of the North German Confederation and the Austrian-Hungarian Dual Monarchy"
    },
    {
        "start": {
            "year": 1866
        },
        "end": {
            "year": 1868
        },
        "event": "Famine in Finland"
    },
    {
        "start": {
            "year": 1866
        },
        "end": {
            "year": 1869
        },
        "event": "After the Meiji Restoration, Japan embarks on a program of rapid modernization"
    },
    {
        "start": {
            "year": 1867
        },
        "event": "The United States purchases Alaska from Russia"
    },
    {
        "start": {
            "year": 1867
        },
        "event": "Canadian Confederation formed"
    },
    {
        "start": {
            "year": 1867
        },
        "event": "Alfred Nobel invents dynamite"
    },
    {
        "start": {
            "year": 1867
        },
        "event": "The Principality of Serbia passes a Constitution which defines its independence from the Ottoman Empire. International recognition followed in 1878"
    },
    {
        "start": {
            "year": 1867
        },
        "event": "The Luxembourg Crisis: diplomatic confrontation between France and Prussia on the status of Luxembourg and the towns fortifications are torn down"
    },
    {
        "start": {
            "year": 1868
        },
        "event": "The Expatriation Act of 1868 is approved by the U.S. Congress, one of the early blows which would eventually lead to the death of the common law doctrine of perpetual allegiance"
    },
    {
        "start": {
            "year": 1868
        },
        "event": "The Fourteenth Amendment to the United States Constitution is approved"
    },
    {
        "start": {
            "year": 1868
        },
        "event": "Cro-Magnon man first identified"
    },
    {
        "start": {
            "year": 1868
        },
        "event": "Michael Barrett is the last person to be publicly hanged in England"
    },
    {
        "start": {
            "year": 1868
        },
        "end": {
            "year": 1878
        },
        "event": "Ten Years' War between Cuba and Spain"
    },
    {
        "start": {
            "year": 1868
        },
        "event": "The Batavian Museum (today National Museum of Indonesia) was officially opened by Dutch East Indies government"
    },
    {
        "start": {
            "year": 1869
        },
        "event": "Leo Tolstoy publishes War and Peace"
    },
    {
        "start": {
            "year": 1869
        },
        "event": "First Transcontinental Railroad completed in United States on 10 May. - United States"
    },
    {
        "start": {
            "year": 1869
        },
        "event": "Dmitri Mendeleev created the Periodic table"
    },
    {
        "start": {
            "year": 1869
        },
        "event": "The Suez Canal opens linking the Mediterranean to the Red Sea"
    },
    {
        "start": {
            "year": 1870
        },
        "event": "Rasmus Malling-Hansen's invention the Hansen Writing Ball becomes the first commercially sold typewriter"
    },
    {
        "start": {
            "year": 1870
        },
        "end": {
            "year": 1871
        },
        "event": "The Franco-Prussian War results in the unifications of Germany and Italy, the collapse of the Second French Empire and the emergence of a New Imperialism"
    },
    {
        "start": {
            "year": 1870
        },
        "event": "Official dismantling of the Cultivation System and beginning of a 'Liberal Policy' of deregulated exploitation of the Netherlands East Indies."
    },
    {
        "start": {
            "year": 1870
        },
        "end": {
            "year": 1890
        },
        "event": "Long Depression in Western Europe and North America"
    },
    {
        "start": {
            "year": 1871
        },
        "end": {
            "year": 1878
        },
        "event": "In Germany, Otto von Bismarck attacks the privileges of the Catholic Church in the Kulturkampf (\"Culture War\")"
    },
    {
        "start": {
            "year": 1871
        },
        "end": {
            "year": 1872
        },
        "event": "Famine in Persia is believed to have caused the death of 2 million"
    },
    {
        "start": {
            "year": 1871
        },
        "end": {
            "year": 1914
        },
        "event": "Second Industrial Revolution"
    },
    {
        "start": {
            "year": 1871
        },
        "event": "Royal Albert Hall opens in London"
    },
    {
        "start": {
            "year": 1871
        },
        "event": "The Paris Commune briefly rules the French capital"
    },
    {
        "start": {
            "year": 1871
        },
        "event": "The feudal system is dismantled in Japan"
    },
    {
        "start": {
            "year": 1871
        },
        "event": "Henry Morton Stanley meets Dr. David Livingstone near Lake Tanganyika"
    },
    {
        "start": {
            "year": 1872
        },
        "event": "Yellowstone National Park, the first national park, is created"
    },
    {
        "start": {
            "year": 1872
        },
        "event": "The first recognised international soccer match, between England and Scotland, is played"
    },
    {
        "start": {
            "year": 1873
        },
        "event": "The Panic of 1873 starts the \"Long Depression\""
    },
    {
        "start": {
            "year": 1873
        },
        "event": "Maxwell's A Treatise on Electricity and Magnetism published"
    },
    {
        "start": {
            "year": 1873
        },
        "event": "The samurai class is abolished in Japan"
    },
    {
        "start": {
            "year": 1873
        },
        "event": "Blue jeans and barbed wire are invented"
    },
    {
        "start": {
            "year": 1873
        },
        "event": "The beginning of the bloody Aceh War for Dutch occupation of the province."
    },
    {
        "start": {
            "year": 1874
        },
        "event": "The Société Anonyme Coopérative des Artistes Peintres, Sculpteurs, and Graveurs, better known as the Impressionists, organize and present their first public group exhibition at the Paris studio of the photographer Nadar"
    },
    {
        "start": {
            "year": 1874
        },
        "event": "The Home Rule Movement is established in Ireland"
    },
    {
        "start": {
            "year": 1874
        },
        "event": "The British East India Company is dissolved"
    },
    {
        "start": {
            "year": 1874
        },
        "end": {
            "year": 1875
        },
        "event": "First Republic in Spain"
    },
    {
        "start": {
            "year": 1875
        },
        "event": "HMS Challenger surveys the deepest point in the Earth's oceans, the Challenger Deep"
    },
    {
        "start": {
            "year": 1875
        },
        "end": {
            "year": 1900
        },
        "event": "26 million Indians perish in India due to famine"
    },
    {
        "start": {
            "year": 1875
        },
        "event": "Georges Bizet's opera Carmen premiers in Paris"
    },
    {
        "start": {
            "year": 1876
        },
        "event": "Bulgarians instigate the April Uprising against Ottoman rule"
    },
    {
        "start": {
            "year": 1876
        },
        "event": "Richard Wagner's Ring Cycle is first performed in its entirety"
    },
    {
        "start": {
            "year": 1876
        },
        "event": "Queen Victoria becomes Empress of India"
    },
    {
        "start": {
            "year": 1876
        },
        "event": "Battle of the Little Bighorn leads to the death of General Custer and victory for the alliance of Lakota, Cheyenne and Arapaho"
    },
    {
        "start": {
            "year": 1876
        },
        "end": {
            "year": 1879
        },
        "event": "13 million Chinese die of famine in northern China"
    },
    {
        "start": {
            "year": 1876
        },
        "end": {
            "year": 1914
        },
        "event": "The massive expansion in population, territory, industry and wealth in the United States is referred to as the Gilded Age"
    },
    {
        "start": {
            "year": 1877
        },
        "event": "Great Railroad Strike in the United States may have been the world's first nationwide labour strike"
    },
    {
        "start": {
            "year": 1877
        },
        "event": "Crazy Horse surrenders and is later killed"
    },
    {
        "start": {
            "year": 1877
        },
        "event": "Asaph Hall discovers the moons of Mars"
    },
    {
        "start": {
            "year": 1877
        },
        "event": "Thomas Edison invents the phonograph"
    },
    {
        "start": {
            "year": 1877
        },
        "end": {
            "year": 1878
        },
        "event": "Following the Russo-Turkish War, the Treaty of Berlin recognizes formal independence of the Principality of Serbia, Montenegro and Romania. Bulgaria becomes autonomous"
    },
    {
        "start": {
            "year": 1878
        },
        "event": "First commercial telephone exchange in New Haven, Connecticut"
    },
    {
        "start": {
            "year": 1879
        },
        "event": "Anglo-Zulu War in South Africa. - South Africa"
    },
    {
        "start": {
            "year": 1879
        },
        "event": "Thomas Edison tests his first light bulb"
    },
    {
        "start": {
            "year": 1879
        },
        "end": {
            "year": 1880
        },
        "event": "Little War against Spanish rule in Cuba leads to rebel defeat"
    },
    {
        "start": {
            "year": 1879
        },
        "end": {
            "year": 1883
        },
        "event": "Chile battles with Peru and Bolivia over Andean territory in the War of the Pacific"
    },
    {
        "start": {
            "year": 1879
        },
        "end": {
            "year": 1884
        },
        "event": "Belgium is engulfed in a political crisis, dubbed the First School War, over the role of religion in state education"
    },
    {
        "start": {
            "year": 1879
        },
        "event": "21 April, Kartini was born in Jepara, today the date is commemorated as women's emancipation day in Indonesia"
    },
    {
        "start": {
            "year": 1880
        },
        "end": {
            "year": 1881
        },
        "event": "the First Boer War"
    },
    {
        "start": {
            "year": 1881
        },
        "event": "Tsar Alexander II is assassinated"
    },
    {
        "start": {
            "year": 1881
        },
        "event": "Wave of pogroms begins in the Russian Empire"
    },
    {
        "start": {
            "year": 1881
        },
        "event": "Gunfight at the O.K. Corral. Sitting Bull surrenders"
    },
    {
        "start": {
            "year": 1881
        },
        "event": "First electrical power plant and grid in Godalming, Britain"
    },
    {
        "start": {
            "year": 1881
        },
        "event": "President James A. Garfield is assassinated"
    },
    {
        "start": {
            "year": 1881
        },
        "end": {
            "year": 1882
        },
        "event": "The Jules Ferry laws are passed in France establishing free, secular education"
    },
    {
        "start": {
            "year": 1881
        },
        "end": {
            "year": 1899
        },
        "event": "The Mahdist War in Sudan"
    },
    {
        "start": {
            "year": 1882
        },
        "event": "The British invasion and subsequent occupation of Egypt"
    },
    {
        "start": {
            "year": 1883
        },
        "event": "Krakatoa volcano explosion, one of the largest in modern history"
    },
    {
        "start": {
            "year": 1883
        },
        "event": "The quagga is rendered extinct"
    },
    {
        "start": {
            "year": 1883
        },
        "event": "Robert Louis Stevenson's Treasure Island is published"
    },
    {
        "start": {
            "year": 1884
        },
        "event": "Siege of Khartoum"
    },
    {
        "start": {
            "year": 1884
        },
        "event": "Germany gains control of Cameroon"
    },
    {
        "start": {
            "year": 1884
        },
        "event": "Mark Twain publishes The Adventures of Huckleberry Finn"
    },
    {
        "start": {
            "year": 1884
        },
        "event": "Sir Hiram Maxim invents the first self-powered Machine gun"
    },
    {
        "start": {
            "year": 1884
        },
        "end": {
            "year": 1885
        },
        "event": "The Berlin Conference signals the start of the European \"scramble for Africa\". Attending nations also agree to ban trade in slaves"
    },
    {
        "start": {
            "year": 1884
        },
        "end": {
            "year": 1885
        },
        "event": "The Sino-French War led to the formation of French Indochina"
    },
    {
        "start": {
            "year": 1885
        },
        "event": "Louis Pasteur creates the first successful vaccine against rabies for a young boy who had been bitten 14 times by a rabid dog"
    },
    {
        "start": {
            "year": 1885
        },
        "event": "King Leopold II of Belgium establishes the Congo Free State as a personal fiefdom"
    },
    {
        "start": {
            "year": 1885
        },
        "event": "Britain establishes a protectorate over Bechuanaland (modern Botswana)"
    },
    {
        "start": {
            "year": 1885
        },
        "event": "Singer begins production of the 'Vibrating Shuttle'. which would become the most popular model of sewing machine"
    },
    {
        "start": {
            "year": 1885
        },
        "event": "Rock Springs massacre: White miners rioted, killing at least 28 Chinese immigrant miners"
    },
    {
        "start": {
            "year": 1886
        },
        "event": "\"The Strange Case of Dr. Jekyll and Mr. Hyde\" by Robert Louis Stevenson is published"
    },
    {
        "start": {
            "year": 1886
        },
        "event": "Burma is presented to Queen Victoria as a birthday gift"
    },
    {
        "start": {
            "year": 1886
        },
        "event": "Karl Benz sells the first commercial automobile"
    },
    {
        "start": {
            "year": 1886
        },
        "event": "Construction of the Statue of Liberty; Coca-Cola is developed"
    },
    {
        "start": {
            "year": 1886
        },
        "event": "Russian-Circassian War ended with the defeat and the exile of many Circassians. Imam Shamil defeated"
    },
    {
        "start": {
            "year": 1887
        },
        "event": "The British Empire takes over Balochistan"
    },
    {
        "start": {
            "year": 1887
        },
        "event": "Sir Arthur Conan Doyle publishes his first Sherlock Holmes story, A Study in Scarlet"
    },
    {
        "start": {
            "year": 1888
        },
        "event": "Louis Le Prince records the Roundhay Garden Scene, the earliest surviving film"
    },
    {
        "start": {
            "year": 1888
        },
        "event": "Jack the Ripper murders occur in Whitechapel, London"
    },
    {
        "start": {
            "year": 1888
        },
        "event": "Slavery banned in Brazil"
    },
    {
        "start": {
            "year": 1888
        },
        "event": "Founding of the shipping line Koninklijke Paketvaart-Maatschappij (KPM) that supported the unification and development of the colonial economy."
    },
    {
        "start": {
            "year": 1889
        },
        "event": "The Mayerling Incident: Crown Prince Rudolf of Austria and Baroness Mary Vetsera are found dead in an apparent murder-suicide"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "Eiffel Tower is inaugurated in Paris"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "Mirza Ghulam Ahmad establishes the Ahmadiyya Muslim Community, a reform sect of Islam"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "End of the Brazilian Empire and the beginning of the Brazilian Republic"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "Vincent van Gogh paints Starry Night"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "Aspirin patented"
    },
    {
        "start": {
            "year": 1889
        },
        "event": "Moulin Rouge opens in Paris"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "The Wounded Knee Massacre in South Dakota was the last battle in the American Indian Wars. This event represents the end of the American Old West"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "Italy annexes Eritrea"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "First use of the electric chair as a method of execution"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "Independence of Luxembourg"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "Death of Vincent van Gogh"
    },
    {
        "start": {
            "year": 1890
        },
        "event": "The cardboard box is invented"
    },
    {
        "start": {
            "year": 1891
        },
        "event": "Mirza Ghulam Ahmad, founder of the Ahmadiyya movement, claims to be Promised Messiah and Imam Mahdi"
    },
    {
        "start": {
            "year": 1891
        },
        "event": "1891 Chilean Civil War"
    },
    {
        "start": {
            "year": 1891
        },
        "event": "Wrigley Company is founded in Illinois"
    },
    {
        "start": {
            "year": 1892
        },
        "event": "Basketball is invented"
    },
    {
        "start": {
            "year": 1892
        },
        "event": "The World's Columbian Exposition was held in Chicago celebrating the 400th anniversary of Christopher Columbus's arrival in the New World"
    },
    {
        "start": {
            "year": 1892
        },
        "event": "Fingerprinting is officially adopted for the first time"
    },
    {
        "start": {
            "year": 1892
        },
        "event": "Tchaikovsky's Nutcracker Suite premières in St Petersberg"
    },
    {
        "start": {
            "year": 1892
        },
        "event": "John Froelich develops and constructs the first gasoline/petrol-powered tractor"
    },
    {
        "start": {
            "year": 1893
        },
        "event": "US forces overthrow the government of Hawaii"
    },
    {
        "start": {
            "year": 1893
        },
        "event": "The Internal Macedonian Revolutionary Organisation is formed"
    },
    {
        "start": {
            "year": 1893
        },
        "event": "New Zealand becomes the first country to enact women's suffrage"
    },
    {
        "start": {
            "year": 1893
        },
        "event": "The Coremans-de Vriendt law is passed in Belgium, creating legal equality for French and Dutch languages"
    },
    {
        "start": {
            "year": 1894
        },
        "event": "First commercial film release by Jean Aimé Le Roy.[citation needed]"
    },
    {
        "start": {
            "year": 1894
        },
        "event": "First gramophone record"
    },
    {
        "start": {
            "year": 1894
        },
        "event": "Karl Elsener invents the Swiss Army knife"
    },
    {
        "start": {
            "year": 1894
        },
        "event": "France and the Russian Empire form a military alliance"
    },
    {
        "start": {
            "year": 1894
        },
        "end": {
            "year": 1895
        },
        "event": "After the First Sino-Japanese War, China cedes Taiwan to Japan and grants Japan a free hand in Korea"
    },
    {
        "start": {
            "year": 1894
        },
        "end": {
            "year": 1906
        },
        "event": "Dreyfuss Affair in France"
    },
    {
        "start": {
            "year": 1894
        },
        "event": "Lombok War The Dutch looted and destroyed the Cakranegara palace of Mataram. J. L. A. Brandes, a Dutch philologist discovered and secured Nagarakretagama manuscript in Lombok royal library"
    },
    {
        "start": {
            "year": 1895
        },
        "event": "Volleyball is invented"
    },
    {
        "start": {
            "year": 1895
        },
        "event": "Trial of Oscar Wilde and premiere of his play The Importance of Being Earnest"
    },
    {
        "start": {
            "year": 1895
        },
        "event": "French troops capture Antananarivo in Madagascar"
    },
    {
        "start": {
            "year": 1895
        },
        "event": "Wilhelm Röntgen identifies x-rays"
    },
    {
        "start": {
            "year": 1895
        },
        "end": {
            "year": 1896
        },
        "event": "Abyssinia defeats Italy in the First Italo–Ethiopian War"
    },
    {
        "start": {
            "year": 1895
        },
        "end": {
            "year": 1898
        },
        "event": "Cuban War for Independence results in Cuban independence from Spain"
    },
    {
        "start": {
            "year": 1896
        },
        "event": "Olympic Games revived in Athens"
    },
    {
        "start": {
            "year": 1896
        },
        "event": "Philippine Revolution ends declaring Philippines free from Spanish rule"
    },
    {
        "start": {
            "year": 1896
        },
        "event": "Ethiopia defeated Italy at the Battle of Adwa"
    },
    {
        "start": {
            "year": 1896
        },
        "event": "Klondike Gold Rush in Canada"
    },
    {
        "start": {
            "year": 1896
        },
        "event": "Henri Becquerel discovers radioactivity; J. J. Thomson identifies the electron, though not by name"
    },
    {
        "start": {
            "year": 1897
        },
        "event": "Gojong, or Emperor Gwangmu, proclaims the short-lived Korean Empire: lasts until 1910"
    },
    {
        "start": {
            "year": 1897
        },
        "event": "Benin Expedition of 1897 loots and burns Benin"
    },
    {
        "start": {
            "year": 1897
        },
        "event": "Greco-Turkish War"
    },
    {
        "start": {
            "year": 1897
        },
        "event": "Bram Stoker writes Dracula"
    },
    {
        "start": {
            "year": 1898
        },
        "event": "The United States gains control of Cuba, Puerto Rico, and the Philippines after the Spanish–American War"
    },
    {
        "start": {
            "year": 1898
        },
        "event": "Empress Dowager Cixi of China engineers a coup d'état, marking the end of the Hundred Days' Reform; the Guangxu Emperor is arrested"
    },
    {
        "start": {
            "year": 1898
        },
        "event": "H. G. Wells publishes The War of the Worlds"
    },
    {
        "start": {
            "year": 1898
        },
        "event": "Empress Elisabeth of Austria is assassinated by anarchist Luigi Lucheni"
    },
    {
        "start": {
            "year": 1898
        },
        "end": {
            "year": 1900
        },
        "event": "The Boxer Rebellion in China is suppressed by an Eight-Nation Alliance"
    },
    {
        "start": {
            "year": 1898
        },
        "end": {
            "year": 1902
        },
        "event": "The Thousand Days' War in Colombia breaks out between the \"Liberales\" and \"Conservadores\", culminating with the loss of Panama in 1903"
    },
    {
        "start": {
            "year": 1898
        },
        "event": "General van Heutz becomes chief of staff of Aceh campaign. Wilhelmina becomes queen of the Netherlands."
    },
    {
        "start": {
            "year": 1899
        },
        "end": {
            "year": 1902
        },
        "event": "Second Boer War begins"
    },
    {
        "start": {
            "year": 1899
        },
        "end": {
            "year": 1913
        },
        "event": "Philippine–American War begins"
    },
    {
        "start": {
            "year": 1899
        },
        "end": {
            "year": 1900
        },
        "event": "Indian famine kills over 1 million people"
    }
]